max-bot-cf/DataProcessors/энргКалькуляторНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргКалькуляторНачисленияПени</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

max-bot-cf/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

max-bot-cf/DataProcessors/энргКалькуляторНачисленияПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПересчитатьСДатыПоследнегоИзменения(Организация,Район,ПериодНачисления,СтавкаРефинансирования) Экспорт
		
	Набор 									= РегистрыНакопления.энргВзаиморасчетыПоПени.СоздатьНаборЗаписей();
		
	ГраницыПериодаНачисления 				= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район, ПериодНачисления,Ложь);
	СтавкиРефинансированияДо 				= РегистрыСведений.энргСтавкиРефинансирования.СрезПоследних(ГраницыПериодаНачисления.НачалоОП-1, Новый Структура("Организация", Организация));	
	Если СтавкиРефинансированияДо.Количество() = 0 Тогда
		Возврат Набор;
	КонецЕсли;
	
	СтавкаРефинансированияДо				= СтавкиРефинансированияДо[0].Коэффициент;
	
	Запрос  								= Новый Запрос;
	Запрос.Текст 							=
	"ВЫБРАТЬ
	|	энргНастройкаРасчетаПениСрезПоследних.НастройкаРасчета КАК НастройкаРасчета
	|ИЗ
	|	РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&Период, ) КАК энргНастройкаРасчетаПениСрезПоследних";
	Запрос.УстановитьПараметр("Период", ГраницыПериодаНачисления.НачалоОП);
	
	Результат  								= Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены настройки расчет пени, Начисление пени не может быть выполнено");
		Возврат Набор;
	КонецЕсли;
	Выборка  								= Результат.Выбрать();
	Выборка.Следующий();
	НастройкиРасчетаПени 					= Выборка.НастройкаРасчета.Получить();
	НастройкиРасчетаПени.Сортировать("От");
	
	ПолучаемыеНаборы 						= Новый Массив;
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","ИсторияИзмененияЗадолженности",				"ИсторияИзмененияЗадолженности"));
	ПолучаемыеНаборы.Добавить(Новый Структура("ИмяНабора,ТаблицаДляПомещения","НастройкиНачисленияПени",					"НастройкиНачисленияПени"));
	
	МВТ  									= Новый МенеджерВременныхТаблиц; 	
	ИнициализироватьТаблицыДанных(МВТ,Организация,ГраницыПериодаНачисления.НачалоОП);		
	Результат 								= РезультатДниПросрочки(МВТ);	
	Выборка  								= Результат.Выбрать();
	
	текРайон								= Неопределено;
	текМКД 									= Неопределено;	
	текАбонент								= Неопределено;
	текУслуга								= Неопределено;
	текПериодНачисления						= Неопределено;	
	СуммаДолга 								= Неопределено;
	Период 									= Неопределено;
	ДнейПросрочкиВсего						= Неопределено;
	УжеНачисленоДней 						= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ текРайон = Выборка.Район
			ИЛИ НЕ текМКД = Выборка.МКД
			ИЛИ НЕ текАбонент = Выборка.Абонент
			ИЛИ НЕ текУслуга = Выборка.Услуга
			ИЛИ НЕ текПериодНачисления = Выборка.ПериодНачисления Тогда
			
			Если НЕ текРайон = Неопределено Тогда
				
				яСтавкаРефинансирования 		= СтавкаРефинансирования;								
				ДнейПросрочкиВсего 				= ДнейПросрочкиВсего + (ГраницыПериодаНачисления.НачалоОП - Период) / 86400;
				СуммаПени 						= СуммаПени + СуммаПениЗаПериод(Период,ГраницыПериодаНачисления.НачалоОП,СуммаДолга,ДнейПросрочкиВсего,УжеНачисленоДней,яСтавкаРефинансирования, НастройкиРасчетаПени);
				
				Если СуммаПени <> 0 Тогда
					СтрокаНабора 					= Набор.Добавить();
					СтрокаНабора.Период 			= ГраницыПериодаНачисления.НачалоОП;
					СтрокаНабора.Организация 		= Организация;
					СтрокаНабора.Район 				= текРайон;
					СтрокаНабора.МКД 				= текМКД;
					СтрокаНабора.Абонент 			= текАбонент;
					СтрокаНабора.Услуга 			= текУслуга;
					СтрокаНабора.ПериодНачисления 	= текПериодНачисления;
					СтрокаНабора.Сумма 				= СуммаПени;
				КонецЕсли;
			КонецЕсли;		
			УжеНачисленоДней 					= 0;
			УжеНачисленоДнейИзменение			= 0;
			ДнейПросрочкиВсего 					= 0;
			СуммаПени 							= 0;
			Если Выборка.Период > Выборка.ДатаНачалаНачисленияПени Тогда
				ДнейПросрочкиВсего 				= (Выборка.Период - Выборка.ДатаНачалаНачисленияПени) / 86400;
				СуммаПени 						= СуммаПениЗаПериод(Выборка.ДатаНачалаНачисленияПени,Выборка.Период,Выборка.СуммаКонечныйОстаток,ДнейПросрочкиВсего,УжеНачисленоДней,СтавкаРефинансирования,НастройкиРасчетаПени);
			КонецЕсли;
		КонецЕсли; 				
		
		ИзменениеЗадолженности 					= Выборка.СуммаНачальныйОстаток - Выборка.СуммаКонечныйОстаток;
		Если ИзменениеЗадолженности > 0 Тогда
			ДнейПросрочкиВсего 					= (Выборка.Период - Выборка.ДатаНачалаНачисленияПени) / 86400;
			СуммаПени 							= СуммаПени + СуммаПениЗаПериод(Выборка.ДатаНачалаНачисленияПени,Выборка.Период,ИзменениеЗадолженности,ДнейПросрочкиВсего,УжеНачисленоДнейИзменение,СтавкаРефинансированияДо,НастройкиРасчетаПени);
		КонецЕсли;
		
		СуммаДолга 								= Выборка.СуммаКонечныйОстаток;			
		Период 									= Макс(Выборка.Период,Выборка.ДатаНачалаНачисленияПени);	
		
		текРайон 								= Выборка.Район;
		текМКД 									= Выборка.МКД;
		текАбонент 								= Выборка.Абонент;
		текУслуга 								= Выборка.Услуга;
		текПериодНачисления 					= Выборка.ПериодНачисления;		
	КонецЦикла;
	            	
	Если НЕ текРайон = Неопределено Тогда
		
		Если Период < Выборка.ДатаПоследнегоИзменения ТОгда
			яСтавкаРефинансирования 			= СтавкаРефинансированияДо;
		Иначе
			яСтавкаРефинансирования 			= СтавкаРефинансирования;
		КонецЕсли;				
		ДнейПросрочкиВсего 						= ДнейПросрочкиВсего + (ГраницыПериодаНачисления.НачалоОП - Период) / 86400;
		СуммаПени 								= СуммаПени + СуммаПениЗаПериод(Период,ГраницыПериодаНачисления.НачалоОП,СуммаДолга,ДнейПросрочкиВсего,УжеНачисленоДней,яСтавкаРефинансирования, НастройкиРасчетаПени);
		
		Если НЕ СуммаПени = 0 Тогда	
			СтрокаНабора 						= Набор.Добавить();
			СтрокаНабора.Период 				= ГраницыПериодаНачисления.НачалоОП;
			СтрокаНабора.Организация 			= Организация;
			СтрокаНабора.Район 					= текРайон;
			СтрокаНабора.МКД 					= текМКД;
			СтрокаНабора.Абонент 				= текАбонент;
			СтрокаНабора.Услуга 				= текУслуга;
			СтрокаНабора.ПериодНачисления 		= текПериодНачисления;
			СтрокаНабора.Сумма 					= СуммаПени;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Набор;
	
КонецФункции

Функция ПрочитатьУжеНачисленнуюПеню(Организация,Район,ПериодНачисления, Набор) Экспорт
	ГраницыПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления,Ложь);
	Запрос  						= Новый Запрос(ТекстЗапросаУжеНачисленноСДатыПоследнейОплаты());
	Запрос.МенеджерВременныхТаблиц 	= Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Набор", 			Набор);
	Запрос.УстановитьПараметр("КонецПериода", 	ГраницыПериодаНачисления.НачалоОП);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Результат  						= Запрос.Выполнить();
	НачисленияПениБыло 				= РегистрыНакопления.энргВзаиморасчетыПоПени.СоздатьНаборЗаписей();
	НачисленияПениБыло.Загрузить(Результат.Выгрузить());
	
	Возврат НачисленияПениБыло;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьТаблицыДанных(МВТ,Организация,НачалоОтчетногоПериода)
	Схема  								= Неопределено;
	ПрочитатьНастройкиНачисленияПени(Схема,"НастройкиНачисленияПени");
	ПрочитатьИсторияИзмененияЗадолженности(Схема,"ИсторияИзмененияЗадолженности");
	
	Запрос  							= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("Период", 		НачалоОтчетногоПериода);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПрочитатьИсторияИзмененияЗадолженности(Схема,ТаблицаДляПомещения) 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстИсторияИзмененияЗадолженности());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

Процедура ПрочитатьНастройкиНачисленияПени(Схема,ТаблицаДляПомещения) 
	
	Если Схема = Неопределено Тогда
		Схема 					= Новый СхемаЗапроса;
		Пакет 					= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 					= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстНастройкиНачисленияПени());
	Пакет.ТаблицаДляПомещения 	= ТаблицаДляПомещения;
	
КонецПроцедуры

Функция СуммаПениЗаПериод(НачалоПериода,КонецПериода,СуммаДолга,ДнейПросрочкиВсего,УжеНачисленоДней,СтавкаРефинансирования,НастройкиРасчетаПени)
	 
	ДнейПросрочкиОсталось 				= (КонецПериода - НачалоПериода) /86400;;
	КоэффициентСтавкиРефинансирования 	= СтавкаРефинансирования / 100;
	СуммаПени 							= 0;
	яУжеНачисленоДней 					= УжеНачисленоДней;
	Для Каждого СтрокаНастройки Из НастройкиРасчетаПени Цикл			
		Если ДнейПросрочкиВсего < СтрокаНастройки.От Тогда				
			Продолжить;
		ИначеЕсли ДнейПросрочкиВсего > СтрокаНастройки.До И НЕ СтрокаНастройки.До = 0 И НЕ УжеНачисленоДней = 0 Тогда				
			Продолжить; 		
		КонецЕсли;
		
		Если СтрокаНастройки.До = 0 Тогда
			Если УжеНачисленоДней = 0 Тогда
				ДнейПросрочки 				= ДнейПросрочкиОсталось - 1;
			Иначе
				ДнейПросрочки 				= ДнейПросрочкиОсталось;
			КонецЕсли;
		Иначе
			Если ДнейПросрочкиОсталось > СтрокаНастройки.До Тогда
				ДнейПросрочки 				= Мин(СтрокаНастройки.До, ДнейПросрочкиОсталось) - (СтрокаНастройки.От) + 1;
			Иначе
				ДнейПросрочки 				= Мин(СтрокаНастройки.До, ДнейПросрочкиОсталось) - (СтрокаНастройки.От);
			КонецЕсли;
		КонецЕсли;
				
		яУжеНачисленоДней 				= яУжеНачисленоДней + ДнейПросрочки;
		СуммаПени 						= СуммаПени + Окр(СуммаДолга * ДнейПросрочки * КоэффициентСтавкиРефинансирования * СтрокаНастройки.Числитель / СтрокаНастройки.Знаменатель,2);
		ДнейПросрочкиОсталось 			= ДнейПросрочкиОсталось - Мин(СтрокаНастройки.До, ДнейПросрочкиОсталось);
		Если ДнейПросрочкиОсталось = 0 Тогда
			Прервать;
		КонецЕсли;			
	КонецЦикла;
	
	УжеНачисленоДней 					= яУжеНачисленоДней;
	
	Возврат СуммаПени;
	
КонецФункции

Функция РезультатДниПросрочки(МВТ)
	
	Запрос 								= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.Текст 						=
	"ВЫБРАТЬ
	|	ИсторияИзмененияЗадолженности.Район КАК Район,
	|	ИсторияИзмененияЗадолженности.МКД КАК МКД,
	|	ИсторияИзмененияЗадолженности.Абонент КАК Абонент,
	|	ИсторияИзмененияЗадолженности.Услуга КАК Услуга,
	|	ИсторияИзмененияЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	МИНИМУМ(ИсторияИзмененияЗадолженности.Период) КАК ДатаВозникновения,
	|	МАКСИМУМ(ИсторияИзмененияЗадолженности.Период) КАК ДатаПоследнегоИзменения
	|ПОМЕСТИТЬ ДатаНачала
	|ИЗ
	|	ИсторияИзмененияЗадолженности КАК ИсторияИзмененияЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияИзмененияЗадолженности.Абонент,
	|	ИсторияИзмененияЗадолженности.Услуга,
	|	ИсторияИзмененияЗадолженности.ПериодНачисления,
	|	ИсторияИзмененияЗадолженности.Район,
	|	ИсторияИзмененияЗадолженности.МКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаОборот КАК СуммаОборот,
	|	ВложенныйЗапрос.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ВложенныйЗапрос.ДатаВозникновения КАК ДатаВозникновения,
	|	ВложенныйЗапрос.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения,
	|	ВложенныйЗапрос.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	РАЗНОСТЬДАТ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ДатаНачалаНачисленияПени > ВложенныйЗапрос.ДатаПоследнегоИзменения
	|				ТОГДА ВложенныйЗапрос.ДатаНачалаНачисленияПени
	|			ИНАЧЕ ВложенныйЗапрос.ДатаПоследнегоИзменения
	|		КОНЕЦ, ВложенныйЗапрос.НачалоПериодаНачисления, ДЕНЬ) КАК ДнейПросрочки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсторияИзмененияЗадолженности.Район КАК Район,
	|		ИсторияИзмененияЗадолженности.МКД КАК МКД,
	|		ИсторияИзмененияЗадолженности.Абонент КАК Абонент,
	|		ИсторияИзмененияЗадолженности.Услуга КАК Услуга,
	|		ИсторияИзмененияЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|		ИсторияИзмененияЗадолженности.Период КАК Период,
	|		ИсторияИзмененияЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		ИсторияИзмененияЗадолженности.СуммаОборот КАК СуммаОборот,
	|		ИсторияИзмененияЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|		ИсторияИзмененияЗадолженности.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
	|		ДатаНачала.ДатаВозникновения КАК ДатаВозникновения,
	|		ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ДатаНачала.ДатаВозникновения, МЕСЯЦ), СЕКУНДА, 1), МЕСЯЦ, ИсторияИзмененияЗадолженности.ГлубинаОтсрочки), ДЕНЬ, ИсторияИзмененияЗадолженности.КрайнийСрокОплаты) КАК ДатаНачалаНачисленияПени,
	|		ДатаНачала.ДатаПоследнегоИзменения КАК ДатаПоследнегоИзменения
	|	ИЗ
	|		ИсторияИзмененияЗадолженности КАК ИсторияИзмененияЗадолженности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	|			ПО ИсторияИзмененияЗадолженности.Район = ДатаНачала.Район
	|				И ИсторияИзмененияЗадолженности.МКД = ДатаНачала.МКД
	|				И ИсторияИзмененияЗадолженности.Абонент = ДатаНачала.Абонент
	|				И ИсторияИзмененияЗадолженности.Услуга = ДатаНачала.Услуга
	|				И ИсторияИзмененияЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления
	|				И (НАЧАЛОПЕРИОДА(ИсторияИзмененияЗадолженности.Период, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(ДатаНачала.ДатаПоследнегоИзменения, МЕСЯЦ))
	|	ГДЕ
	|		ИсторияИзмененияЗадолженности.СуммаКонечныйОстаток >= 0) КАК ВложенныйЗапрос
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВЫБОР
	|				КОГДА ВложенныйЗапрос.ДатаНачалаНачисленияПени > ВложенныйЗапрос.ДатаПоследнегоИзменения
	|					ТОГДА ВложенныйЗапрос.ДатаНачалаНачисленияПени
	|				ИНАЧЕ ВложенныйЗапрос.ДатаПоследнегоИзменения
	|			КОНЕЦ, ВложенныйЗапрос.НачалоПериодаНачисления, ДЕНЬ) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Район,
	|	МКД,
	|	Абонент,
	|	Услуга,
	|	ПериодНачисления,
	|	Период";
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ТекстИсторияИзмененияЗадолженности()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВложенныйЗапрос.СуммаОборот КАК СуммаОборот,
	|	ВложенныйЗапрос.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	НастройкиНачисленияПени.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	НастройкиНачисленияПени.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	&Период КАК НачалоПериодаНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Район КАК Район,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.МКД КАК МКД,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Абонент КАК Абонент,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Услуга КАК Услуга,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период КАК Период,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|		энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.энргВзаиморасчетыПоМесяцам.ОстаткиИОбороты(, &Период, День,Движения , Организация = &Организация) КАК энргВзаиморасчетыПоМесяцамОстаткиИОбороты) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиНачисленияПени КАК НастройкиНачисленияПени
	|		ПО ВложенныйЗапрос.Район = НастройкиНачисленияПени.Район";
	
	Возврат Текст;	
	
КонецФункции

Функция ТекстНастройкиНачисленияПени()
	
	Текст 			=
	"ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.Организация КАК Организация,
	|	энргНастройкиНачисленияПениСрезПоследних.Район КАК Район,
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(&Период, Организация = &Организация) КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаУжеНачисленноСДатыПоследнейОплаты()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоПени.Организация КАК Организация,
	|	ВзаиморасчетыПоПени.Район КАК Район,
	|	ВзаиморасчетыПоПени.МКД КАК МКД,
	|	ВзаиморасчетыПоПени.Абонент КАК Абонент,
	|	ВзаиморасчетыПоПени.Услуга КАК Услуга,
	|	ВзаиморасчетыПоПени.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ НовыйРасчет
	|ИЗ
	|	&Набор КАК ВзаиморасчетыПоПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовыйРасчет.Организация КАК Организация,
	|	НовыйРасчет.Район КАК Район,
	|	НовыйРасчет.МКД КАК МКД,
	|	НовыйРасчет.Абонент КАК Абонент,
	|	НовыйРасчет.Услуга КАК Услуга,
	|	НовыйРасчет.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргВзаиморасчетыПоПениОбороты.СуммаПриход) КАК Сумма
	|ИЗ
	|	НовыйРасчет КАК НовыйРасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(, &КонецПериода, Месяц, Организация = &Организация) КАК энргВзаиморасчетыПоПениОбороты
	|		ПО НовыйРасчет.Организация = энргВзаиморасчетыПоПениОбороты.Организация
	|			И НовыйРасчет.Район = энргВзаиморасчетыПоПениОбороты.Район
	|			И НовыйРасчет.МКД = энргВзаиморасчетыПоПениОбороты.МКД
	|			И НовыйРасчет.Абонент = энргВзаиморасчетыПоПениОбороты.Абонент
	|			И НовыйРасчет.Услуга = энргВзаиморасчетыПоПениОбороты.Услуга
	|			И НовыйРасчет.ПериодНачисления = энргВзаиморасчетыПоПениОбороты.ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	НовыйРасчет.Организация,
	|	НовыйРасчет.Услуга,
	|	НовыйРасчет.МКД,
	|	НовыйРасчет.Абонент,
	|	НовыйРасчет.Район,
	|	НовыйРасчет.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
